TEXTS: dict[str, str] = {
    "hello": """Hey! \nВітаємо у Futurium English School боті - \
твоєму помічнику на шляху у вивченні англійської💛 \
\n\nЩоб ми могли вам краще допомогти - \
підкажіть нам ваш статус у школі ⬇️""",

    "student": "Студент🎓",
    "interested": "Хочу навчатись!🤓",

    "student_q1": "Добре! Яке у вас питання?",
    "review": "Хочу залишити анонімний відгук про навчання📝",

    "want_pay": "Хочу оплатити навчання💰",
    "want_num_lesson": "Хочу дізнатись кількість занять, які у мене залишились📚",
    "want_pay_q1": "Звісно! Який у вас формат навчання?",

    "review_fill": "Заповніть, будь ласка, форму ⬇️",
    "form_review_text": "Відкрий мене ✍️",
    "form_review_url": "https://docs.google.com/forms/d/e/1FAIpQLSfHqJP-LqnfftURYlLoDw5kwSQWVGPhYSO59iBMLR80bjEVkA/viewform?usp=share_link",
    "review_thanks": "Дякуємо! Ви допомагаєте нам стати краще!",

    "interested_q1": "Клас! Будемо раді вам допомогти із вивченням англійської🤞\
\n\nЩо саме вам цікаво дізнатись про навчання?",

    "format_education": "Формат навчання",
    "price": "Ціна навчання",
    "english_level": "Хочу дізнатись свій рівень англійської",

    "enter_name": "Введіть своє Імя та Прізвище українською мовою \
у такому форматі: <i>Петро Петренко</i>",

    "enter_name_error": "Це не схоже на ім'я українською мовою. \
\n\nБудь ласка, введіть своє Імя та Прізвище українською мовою \
у такому форматі: <i>Петро Петренко</i>",

    "left_class_start": "У вас залишилось ",
    "left_class_paid": " оплачених заняття. Хочете оплатити наперед?",
    "left_class_no_paid": " неоплачених заняття. Внесіть будь-ласка оплату💰",

    "no_name": "На жаль, не впізнаємо ваші данні",
    "yes": "Так",
    "later": "Трішки пізніше. Дякую!",
    "good": "Добре! Класних занять!",

    "thanks_after_pay": "Дякуємо! Класних та продуктивніх занять!",

    "individual": "Індивідуальне",
    "in_pair": "У парі",
    "group": "У групі",

    "leave_phone": "Залиште свій номер телефону, щоб ми могли з вами зв'язатись!",
    "phone": "Залишити номер",

    "format_intro": "Формат навчання залежить від ваших цілей, вашого рівня \
та ще низки факторів. У нас в школі ви можете обрати як індивідуальне навчання, \
так і навчання у парі або у міні групі.\
\n\nПро який формат навчання ви хотіли б дізнатись детальніше?",

    "individual_answer": "Для тих, хто постійно на робочих зустрічах \
та хоче мати гнучкий графік та програму, побудовану саме під вас!\
\nТеми: IT, Business, Blogging, Fashion etc.\
\n\n<b>Чому індивідуальне навчання?</b>\
\n1️⃣ Самостійно обираєте тривалість занять, за потреби можна міксувати час у різні дні\
\n2️⃣ Разом із викладачем створюєте програму та обираєте матеріали, \
які будуть цікаві саме вам\
\n3️⃣ Інтерактивне навчання та свій онлайн словник\
\n\n💰3000 грн/8 занять",

    "in_pair_answer": "Навчання із колегою, коханою людиною або друзями - \
це можливість круто та з користю провести час!\
\n\n<b>Чому навчання у парі?</b>\
\n1️⃣ Навчання із близькою людиною = подвійна мотивація\
\n2️⃣ Персональний трекінг прогресу - ви матимите змогу відстежувати \
свій прогрес від самого початку курсу, що надасть змогу вам сфокусуватись \
саме на тих аспектах вивчення мови, які потрібні саме вам.\
\n3️⃣ Інтерактивне навчання із використанням сучасних матеріалів.\
\n\n💰2200 грн/8 занять",

    "group_answer": "Навчання у міні-групі - це можливість швидко подолати \
мовний бар'єр та розвочати говорити уже у перший місяць занять! \
Цікаво, доступно, інтерактивно🤩\
\n\n<b>Чому навчання у міні-групі?</b>\
\n1️⃣ Максимум комунікації на занятті - робота у групах, парах, презентації\
\n2️⃣ Круте ком'юніті! Групове навчання - це не тільки можливість познайомитись \
із різними людьми, це також шалена мотивація та підтримка.\
\n3️⃣ Інтерактивне навчання із використанням сучасних матеріалів. \
Ми міксуємо кембриджські/оскфордські матеріали із аутентичними відео та статтями, \
які не тільки підвищують ваш словниковий запас, але й розширюють ваш кругозір.\
\n\n💰1950 грн/8 занять",

    "want_trial": "Хочу записатись на пробне заняття✍️",
    "want_trail_text": "Напишіть нам",
    "want_more": "Хочу дізнатись більше✍️",

    "payment": "Для оплати пишіть нам",
    "text_link": "Futurium English",
    "link": "https://t.me/futurium_english",
    "trail_thanks": "Дякуємо! Зовсім скоро наш тічер вам напише у телеграмі, \
щоб обрати час пробного заняття!",
    "phone_thanks": "Дякуємо! Зовсім скоро ми з вами зв'яжемося!",

    "contact": "Більше про нас можна дізнатися в Instagram",
    "contact_url": "Futurium English in Instagram",
    "url": "https://www.instagram.com/futurium.english/",

    "unknown_text": "Вибачте, я не розумію 😔",

    "finish": "Для подальшої роботи з ботом оберіть, будь ласка, розділ ⬇️",


    "test_hello": "Запрошуємо тебе пройти невеликий тест на приблизне \
визначення рівня англійської. \n\n📝 Тест складається з 20 питань різної \
складності, які в основному перевіряють вашу граматику і лексику. \
\n\nСаме тому тест НЕ Є 100% відображенням вашого рівня англійської. \
\nРеді? Стеді? Гоу!🏃‍♀️\n\n*Почати тест* - /test\
\n*Закінчити тест* - /finish",

    "after_test": "Ви пройшли тестування! \n✅ Правильних відповідей: ",

    "test_already_start": "🚫 Ви не можете почати тест, тому що \
*ви вже його проходите*.",

    "test_not_start": "❗️Ви ще *не почали тест*.",

    "the_end": "✅ Ви *закінчили тест*."
}


TEXTS_MENU_COMMANDS: dict[str, str] = {
    "/start": "Почати спілкування з ботом",
    "/contact": "Контакти Futurium English School",
    "/cancel": "Повернутися у головне меню"
}
