DOUBLE_NEW_LINE = "\n\n"

NEW_LINE = "\n"

HELLO = (
    "Hey!" +
    NEW_LINE +
    "Вітаємо у Futurium English School боті - твоєму помічнику на шляху у вивченні англійської💛" +
    DOUBLE_NEW_LINE +
    "Щоб ми могли вам краще допомогти - підкажіть нам ваш статус у школі ⬇️"
)

FINISH = "Для подальшої роботи з ботом оберіть, будь ласка, розділ ⬇️"

STUDENT = "Студент🎓"

INTERESTED = "Хочу навчатись!🤓"

STUDENT_Q1 = "Добре! Яке у вас питання?"

REVIEW = "Хочу залишити анонімний відгук про навчання📝"

WANT_PAY = "Хочу оплатити навчання💰"

WANT_NUM_LESSONS = "Хочу дізнатись кількість занять, які у мене залишились📚"

WANT_PAY_Q1 = "Звісно! Який у вас формат навчання?"

REVIEW_FILL = "Заповніть, будь ласка, форму ⬇️"

FORM_REVIEW_TEXT = "Відкрий мене ✍️"

FORM_REVIEW_URL = "https://docs.google.com/forms/d/e/1FAIpQLSfHqJP-LqnfftURYlLoDw5kwSQWVGPhYSO59iBMLR80bjEVkA/viewform?usp=share_link"

REVIEW_THANKS = (
    "Дякуємо! Ви допомагаєте нам стати краще!" +
    DOUBLE_NEW_LINE +
    FINISH
)

INTERESTED_Q1 = (
    "Клас! Будемо раді вам допомогти із вивченням англійської🤞" +
    DOUBLE_NEW_LINE +
    "Що саме вам цікаво дізнатись про навчання?"
)

FORMAT_EDUCATION = "Формат навчання"

PRICE = "Ціна навчання"

ENGLISH_LEVEL = "Хочу дізнатись свій рівень англійської"

ENTER_NAME = (
    "Введіть своє Імя та Прізвище українською мовою у такому форматі: <i>Петро Петренко</i>"
)

ENTER_NAME_ERROR = (
    "Це не схоже на ім'я українською мовою." +
    DOUBLE_NEW_LINE +
    ENTER_NAME
)

LEFT_CLASS_START = "У вас залишилось "

LEFT_CLASS_PAID = " оплачених заняття. Хочете оплатити наперед?"

LEFT_CLASS_NO_PAID = " неоплачених заняття. Внесіть будь-ласка оплату💰"

NO_NAME = "На жаль, не впізнаємо ваші данні"

YES = "Так"

LATER = "Трішки пізніше. Дякую!"

GOOD = (
    "Добре! Класних занять!" +
    DOUBLE_NEW_LINE +
    FINISH
)

THANKS_AFTER_PAY = (
    "Дякуємо! Класних та продуктивніх занять!" +
    DOUBLE_NEW_LINE +
    FINISH
)

INDIVIDUAL = "Індивідуальне"

IN_PAIR = "У парі"

GROUP = "У групі"

LEAVE_PHONE = "Залиште свій номер телефону, щоб ми могли з вами зв'язатись!"

PHONE = "Залишити номер"

FORMAT_INTRO = (
    "Формат навчання залежить від ваших цілей, вашого рівня та ще низки факторів. "
    "У нас в школі ви можете обрати як індивідуальне навчання, "
    "так і навчання у парі або у міні групі." +
    DOUBLE_NEW_LINE +
    "Про який формат навчання ви хотіли б дізнатись детальніше?"
)

INDIVIDUAL_ANSWER = (
    "Для тих, хто постійно на робочих зустрічах та хоче мати гнучкий графік та програму, "
    "побудовану саме під вас!" +
    NEW_LINE +
    "Теми: IT, Business, Blogging, Fashion etc." +
    DOUBLE_NEW_LINE +
    "<b>Чому індивідуальне навчання?</b>" +
    NEW_LINE +
    "1️⃣ Самостійно обираєте тривалість занять, за потреби можна міксувати час у різні дні" +
    NEW_LINE +
    "2️⃣ Разом із викладачем створюєте програму та обираєте матеріали, які будуть цікаві саме вам" +
    NEW_LINE +
    "3️⃣ Інтерактивне навчання та свій онлайн словник" +
    DOUBLE_NEW_LINE +
    "💰3000 грн/8 занять"
)

IN_PAIR_ANSWER = (
    "Навчання із колегою, коханою людиною або друзями - це можливість круто "
    "та з користю провести час!" +
    DOUBLE_NEW_LINE +
    "<b>Чому навчання у парі?</b>" +
    NEW_LINE +
    "1️⃣ Навчання із близькою людиною = подвійна мотивація" +
    NEW_LINE +
    "2️⃣ Персональний трекінг прогресу - ви матимите змогу відстежувати свій прогрес "
    "від самого початку курсу, що надасть змогу вам сфокусуватись саме на тих аспектах "
    "вивчення мови, які потрібні саме вам." +
    NEW_LINE +
    "3️⃣ Інтерактивне навчання із використанням сучасних матеріалів." +
    DOUBLE_NEW_LINE +
    "💰2200 грн/8 занять"
)

GROUP_ANSWER = (
    "Навчання у міні-групі - це можливість швидко подолати мовний бар'єр "
    "та розвочати говорити уже у перший місяць занять! Цікаво, доступно, інтерактивно🤩" +
    DOUBLE_NEW_LINE +
    "<b>Чому навчання у міні-групі?</b>" +
    NEW_LINE +
    "1️⃣ Максимум комунікації на занятті - робота у групах, парах, презентації" +
    "n2️⃣ Круте ком'юніті! Групове навчання - це не тільки можливість познайомитись "
    "із різними людьми, це також шалена мотивація та підтримка." +
    NEW_LINE +
    "3️⃣ Інтерактивне навчання із використанням сучасних матеріалів. "
    "Ми міксуємо кембриджські/оскфордські матеріали із аутентичними відео та статтями, "
    "які не тільки підвищують ваш словниковий запас, але й розширюють ваш кругозір." +
    DOUBLE_NEW_LINE +
    "💰1950 грн/8 занять"
)

WANT_TRIAL = "Хочу записатись на пробне заняття✍️"

WANT_TRIAL_TEXT = "Напишіть нам"

WANT_MORE = "Хочу дізнатись більше✍️"

PAYMENT = "Для оплати пишіть нам"

TEXT_LINK = "Futurium English"

TG_LINK = "https://t.me/futurium_english"

TRAIL_THANKS = (
    "Дякуємо! Зовсім скоро наш тічер вам напише у телеграмі, щоб обрати час пробного заняття!" +
    DOUBLE_NEW_LINE +
    FINISH
)

PHONE_THANKS = (
    "Дякуємо! Зовсім скоро ми з вами зв'яжемося!" +
    DOUBLE_NEW_LINE +
    FINISH
)

CONTACT = "Більше про нас можна дізнатися в Instagram"

CONTACT_URL_TEXT = "Futurium English in Instagram"

CONTACT_URL = "https://www.instagram.com/futurium.english/"

UNKNOWN_TEXT = "Вибачте, я не розумію 😔"

TEST_HELLO = (
    "Запрошуємо тебе пройти невеликий тест на приблизне визначення рівня англійської." +
    DOUBLE_NEW_LINE +
    "📝 Тест складається з 20 питань різної складності, "
    "які в основному перевіряють вашу граматику і лексику." +
    DOUBLE_NEW_LINE +
    "Саме тому тест НЕ Є 100% відображенням вашого рівня англійської." +
    NEW_LINE +
    "Реді? Стеді? Гоу!🏃‍♀️" +
    DOUBLE_NEW_LINE +
    "*Почати тест* - /test" +
    NEW_LINE +
    "*Закінчити тест* - /finish"
)

AFTER_TEST = (
    "Ви пройшли тестування!" +
    NEW_LINE +
    "✅ Правильних відповідей: "
)

TEST_ALREADY_START = "🚫 Ви не можете почати тест, тому що *ви вже його проходите*."

TEST_NOT_START = "❗️Ви ще *не почали тест*."

TEST_THE_END = "✅ Ви *закінчили тест*."


TEXTS_MENU_COMMANDS: dict[str, str] = {
    "/start": "Почати спілкування з ботом",
    "/contact": "Контакти Futurium English School",
    "/cancel": "Повернутися у головне меню"
}
